Repository: 84000/data-translation-memory
Catalog: toh195_84000-the-avalokini-sutra.tmx
Source language: bo
Languages: en

source: །སེམས་ཅན་སྙིང་པོ་མཚུངས་མེད་མཆོད་བྱས་ན།
en: “Whoever worships the peerless quintessential being

source: །དུད་འགྲོའི་སྐྱེ་གནས་གཤིན་རྗེའི་ཡུལ་མི་འགྲོ།
en: Will not be reborn as an animal or in the domain of the Lord of Death.

source: །ངན་འགྲོ་གསུམ་པོ་དེས་ནི་རྣམ་སྤངས་ཏེ།
en: Abandoning the three lower realms,

source: །བདག་དེར་ཕྱིས་མི་སྐྱེ་བར་ཤེས་པར་འགྱུར།
en: He will know that he shall not take birth in them again.

source: །དབང་ལྡན་དབང་ཕྱུག་ཉིད་ཀྱི་ལྷར་འགྱུར་ཏེ།
en: Will become a god, the powerful Īśvara himself.

source: །མི་དམན་དགའ་བའི་སེམས་ཀྱིས་སངས་རྒྱས་མཆོད།
en: He will worship the buddhas with a mind of superior joy,

source: །རྒྱལ་བ་མཆོག་གི་བསྟན་ལ་དད་པར་འགྱུར།
en: And will have faith in the teachings of the supreme victorious ones.

source: །ཚངས་པའི་འཇིག་རྟེན་དབང་ཐོབ་ཚངས་པར་འགྱུར།
en: “He will become Brahmā, ruling over the Brahmā world, Where he will enjoy the most exquisite celestial palaces,

source: །ཡིད་འོང་ཤིན་ཏུ་མཛེས་པའི་སྤོས་ངད་ལྡན།
en: Which are delightful, sweet-scented,

source: །འཛམ་བུའི་ཀླུང་གསེར་འོད་བྱེད་དགའ་འགྱུར་བའི།
en: And shining with gold from the Jambū river.

source: །གཞལ་མེད་ཁང་མཆོག་བལྟ་སྡུག་ཐོབ་པར་འགྱུར།
en: “He will attain the level of the peerless quintessential being,

source: །དེ་ནི་དེད་དཔོན་སྟོབས་བཅུ་ལྡན་པ་པོ། །སེམས་ཅན་སྙིང་པོ་མཚུངས་འདྲ་མེད་པ་འཐོབ།
en: A captain endowed with the ten powers.

source: །ཁ་དོག་མཐའ་ཡས་འཇིག་རྟེན་ཀུན་ན་གསལ།
en: His infinite radiance will shine throughout all the worlds,

source: །གསེར་སྟེང་རིན་ཆེན་བཻ་དཱུརྱ་དང་མཚུངས།
en: Like a thousand gold pieces or beryl gemstones.

source: །སུ་ཞིག་དགའ་བའི་ཡིད་ཀྱིས་མེ་ཏོག་བླངས།
en: “Whoever picks flowers with a joyful mind

source: །དད་སྐྱེས་འཇིག་རྟེན་མགོན་ལ་ཆར་དུ་གཏོར།
en: And faithfully showers them on a protector of the world

source: །དེ་ནི་མི་ཡི་འཇིག་རྟེན་བསོད་ནམས་ལྡན།
en: Will be meritorious in the human world,

source: །རྒྱལ་སྲིད་གནས་ནས་རྒྱལ་བ་མཆོག་བཀུར་འགྱུར།
en: Where, residing in his kingdom, he will venerate the supreme victors.

source: །མྱ་ངན་བསྐམས་ཤིང་ཐ་བ་དྲིར་ལྡན་ལུས།
en: “Even someone who is miserable, skinny, rigid, and smelly

source: །ཡན་ལག་ལེགས་གནས་མཚུངས་མེད་ཐོབ་པར་འགྱུར།
en: Will come to possess a healthy and unmatched body.

source: །སྐྱེ་བོ་མང་པོས་བལྟ་བའི་འོས་ཡིན་ཏེ།
en: Then, fit to be regarded by many beings, he will abandon desire—

source: །དམྱལ་བ་དགྲ་རྩ་འདོད་པ་སྤོང་བར་འགྱུར།
en: The fundamental enemy that leads to the hells.

source: །སྤྱད་པ་རྣམ་པར་སྤྱོད་ཚེ་འདོད་པ་ལ།
en: “In practicing the conduct, he will know

source: །ངན་སྐྱུགས་ཁུང་ལྟར་སྨད་པར་ཤེས་པར་འགྱུར། །ཚངས་སྤྱོད་དགེ་བ་ཁྱད་པར་འཕགས་ལ་སྤྱོད།
en: That desire is loathesome, like a pit of vomit.

source: །དགའ་བའི་སེམས་ཀྱིས་རྟག་ཏུ་སྤྱོད་པར་འགྱུར།
en: Then, with a joyful mind he will always engage In the most superior and virtuous pure conduct.

source: །བསྐལ་པ་མཐའ་ཡས་མང་དུ་དེ་ཁ་ནས།
en: “For infinite eons, the sweet fragrance of beautiful lotus flowers

source: །རབ་མཛེས་ཨུད་པལ་བསུང་ནི་འབྱུང་བར་འགྱུར།
en: Will waft from his mouth.

source: །དེ་ཡི་ལུས་ནི་གསེར་གྱི་མདོག་འདྲ་ཞིང་།
en: His body will have the color of gold

source: །ཙན་དན་ལྟ་བུར་དྲི་ཞིམ་ངད་ཀྱང་འབྱུང་།
en: And carry the fragrance of sandalwood.

source: །སྤྱད་པ་རྣམ་པར་སྤྱོད་ཚེ་ཁྲོ་བ་དང་། །ཐ་བ་དྲི་སྐྱོན་གཏི་མུག་གནོད་མི་བྱེད།
en: “While practicing the conduct, he will not be harmed By wrath, rage, impurity, faults, or ignorance.

source: །དམན་པ་མེད་པའི་སེམས་ཀྱིས་དབུགས་ཕྱིན་རྙེད།
en: With a superior mind, he will find relief

source: །བག་ཡོད་ལྷ་ཡི་ནང་ན་རྒྱལ་པོ་འཐོབ།
en: And become a conscientious king of the gods.

source: །གང་ཚེ་རྒྱལ་བ་མྱ་ངན་འདས་པ་ན།
en: “When victorious ones pass into nirvāṇa,

source: །དེ་ནི་གུས་པས་དེ་དག་ཆོས་ཀྱང་འཛིན།
en: He will respectfully uphold their Dharma.

source: །མི་དམན་དགའ་བའི་སེམས་ཀྱིས་སྦྱིན་པ་སྦྱིན།
en: With a superior and joyful mind, he will be generous,

source: །བཅོམ་ལྡན་མྱ་ངན་འདས་པའི་རིང་བསྲེལ་མཆོད།
en: And will worship the relics of those blessed ones who have passed into nirvāṇa.

source: །རྒྱལ་བ་མཆོག་གི་བསྟན་པ་འཇིག་དུས་ཚེ།
en: “When the doctrine of the supreme victor is about to disappear,

source: །རབ་ཏུ་དགའ་བས་སྟོན་པའི་ཆོས་ཚུལ་འཛིན།
en: He will joyfully uphold the Teacher’s religious precepts.

source: །དེས་ནི་ཆོས་མཆོག་མཛད་པ་དེ་སྤྱད་པས།
en: By engaging in the deeds of the supreme Dharma,

source: །གནོད་པས་འཆི་བའི་དུས་བྱེད་གཞར་མི་འགྱུར།
en: He will never face death through harmful factors.

source: །གལ་ཏེ་སེམས་ཅན་ཐམས་ཅད་སངས་རྒྱས་ཤིང་།
en: “If all beings became buddhas,

source: །ཉོན་མོངས་མེད་པ་གསེར་མདོག་སྟོབས་བཅུར་གྱུར།
en: Free from afflictions, golden, and with the ten powers,

source: །དེ་དག་བསྐལ་བྱེ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དུ། །རྒྱལ་བ་མཆོག་ལ་མཆོད་པའི་བསྔགས་བརྗོད་ནུས།
en: They would be able to express worshipful praise To that supreme victor for billions and trillions of eons.

source: །འཇིག་རྟེན་ཀུན་ཏུ་སྡིག་པའི་ལས་སྤངས་ཏེ།
en: “He will abandon evil deeds in all the worlds,

source: །དགའ་བའི་སེམས་ཀྱིས་མཆོག་གི་ལས་བྱས་ཤིང་།
en: And engage in supreme actions with a joyful mind.

source: །རླབས་ཆེན་སྤྱོད་ཚེ་དོན་ནི་ལེགས་བྱས་ནས།
en: Having worked properly and with great strength for the benefit of beings,

source: །འཇིག་རྟེན་མཐུ་ཆེན་རྫོགས་པའི་སངས་རྒྱས་འགྱུར།
en: He will become a powerful and perfect buddha in the world.

source: །གང་གིས་སྤོས་ཆུ་ཡུངས་འབྲུ་ཙམ་བླངས་ཏེ།
en: “I will now expound the benefits that result

source: །བཅོམ་ལྡན་མཆོད་རྟེན་རྣམས་ལ་བདུག་བྱེད་པ།
en: From sprinkling the stūpas of the blessed ones with perfume,

source: །དེ་ཡི་ཕན་ཡོན་བརྗོད་ཀྱིས་སེམས་དང་ཞིང་།
en: Even as little as a drop the size of a mustard seed;

source: །རྡུལ་དང་དྲི་མ་སྤོངས་ལ་མཉན་པར་གྱིས།
en: So listen sincerely and abandon your stains and defilements!

source: །དེ་ནི་བསོད་ནམས་ལྡན་ཞིང་ཕྱོགས་ཀུན་རྒྱུ།
en: “Such a person will be meritorious and move about in all directions;

source: །ནད་མེད་གྱུར་ཅིང་བློ་བརྟན་བག་ཡོད་ལ།
en: He will be healthy, steadfast in mind, and conscientious.

source: །སྤྱད་པ་རྣམ་པར་སྤྱོད་ཚེ་མྱ་ངན་འདུལ།
en: While practicing the conduct, he will subdue misery,

source: །སྐྱེ་བོ་མང་པོ་དགའ་ཞིང་ཡིད་དུ་འོང་།
en: And he will cause many beings to become happy and pleased.

source: །རྒྱལ་པོ་ཐོབ་ནས་རྒྱལ་བ་མཆོག་བཀུར་འགྱུར།
en: “He will become a king who honors the supreme victors.

source: །མཐུ་ཆེན་རབ་མཁས་འཁོར་ལོས་སྒྱུར་འགྱུར་ཏེ།
en: He will become a powerful and highly learned universal monarch,

source: །གསེར་གྱི་མདོག་ལྡན་མཚན་གྱི་གོ་ཆ་ཅན།
en: Endowed with a golden complexion and wearing the armor of the marks,

source: །འཇིག་རྟེན་ཀུན་ན་ཡིད་འོང་དྲི་ལྡན་འཐོབ།
en: And his fragrance will be pleasing in all the worlds.

source: །དེ་ལ་ཡིད་མི་བདེ་དང་སྡུག་བསྔལ་མེད།
en: “His mind will be free from unhappiness and suffering.

source: །སྤྱད་པ་སྤྱོད་ཚེ་ལོངས་སྤྱོད་ཉམས་མི་འགྱུར།
en: While practicing the conduct, his enjoyments will not decrease.

source: །ཕྱུག་ཅིང་ནོར་ལྡན་མཛོད་ནི་རབ་ཏུ་མང་།
en: He will be rich and prosperous, and his fortune will grow.

source: །མྱ་ངན་མེད་འགྱུར་འཇིག་རྟེན་ཀུན་ཏུ་རྒྱུ།
en: Free from misery, he will move about in all the worlds.

source: །སྐྱེ་བོ་མང་པོ་ལྷགས་ཏེ་དེ་ལ་འདྲི།
en: “Many beings will approach him and request,

source: །རྒྱལ་བ་མཆོག་གི་བསྟན་པ་ཁྱད་འཕགས་ཆོས།
en: ‘Please expound the extraordinary Dharma teachings

source: །ཚིག་རབ་རྗོད་ཅིང་ཐེ་ཙོམ་སེལ་བར་བྱེད།
en: Of the supreme victors and clear away our doubts!’

source: །ཆོས་ཐོས་ཡིད་བདེ་སླར་ཡང་སྨྲ་བར་བྱེད།
en: Hearing the Dharma, they will be pleased and pass it on.

source: །སྡིག་པའི་ལས་མེད་བློ་རྒྱ་ཆེ་དང་ལྡན།
en: “Not committing any evil deeds, he will be open-minded. He will delight in and become learned concerning

source: །རྒྱལ་བས་གསུངས་པའི་ཆོས་མཆོག་ཁྱད་འཕགས་པ། །དགའ་བར་འགྱུར་ལ་རྟག་ཏུ་མཁས་བྱས་ཏེ།
en: The extraordinary, sublime Dharma taught by the victors.

source: །མིག་ཀྱང་སྦྱོང་ཞིང་མུན་པ་སེལ་བར་བྱེད།
en: His vision will be purified, and he will clear away the darkness of ignorance.

source: །འདོད་ཆགས་མི་ཆེ་ཞེ་སྡང་ཆེ་མ་ཡིན།
en: “He will have only minimal attachment and aversion;

source: །མི་ཡི་འཇིག་རྟེན་གཏི་མུག་ཆེ་མ་ཡིན།
en: In the human world, his ignorance will not be great.

source: །དེ་ནི་ཚངས་སྤྱོད་དག་པ་མཆོག་འདི་སྤྱོད།
en: He will practice the supreme pure conduct,

source: །མི་ཡི་དོན་ནི་དཔག་ཏུ་མེད་པ་བྱེད།
en: And accomplish the benefit of beings in ways that cannot be fathomed.

source: །བཅོམ་ལྡན་མཆོད་རྟེན་རྣམས་ལ་སྤོས་བདུགས་ན།
en: “Whoever burns incense at the stūpas of the blessed ones

source: །དེ་ལ་གནོད་པར་སེམས་པ་སུ་ཡང་མེད།
en: Will be free from all malice.

source: །དེ་ནི་ནམས་ཀྱང་ལོངས་སྤྱོད་ཉམས་མི་འགྱུར།
en: His enjoyments will never decrease,

source: །བལྟ་བར་འོས་ཤིང་ནོར་ཆེན་ལྡན་པར་འགྱུར།
en: And he will be estimable and affluent.

source: །བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་རྣམས་སུ།
en: “After his mind has been purified for billions and trillions of eons,

source: །སེམས་ནི་རྣམ་དག་སྡིག་པ་རྣམ་དག་ཅིང་། །ཞི་ཞིང་རབ་ཞི་ཞི་དུལ་ལྡན་གྱུར་ནས།
en: And has become free from evil, peaceful, calm, and gentle,

source: །མི་དམན་སེམས་ཀྱིས་བྱང་ཆུབ་མཚུངས་མེད་འཐོབ།
en: He will obtain unequalled awakening Through his superior attitude.

source: །སེམས་ཅན་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་མཐའ་ཡས།
en: “After establishing billions and trillions, an infinite number of beings,

source: །མྱ་ངན་མེད་བདེ་ཞི་བ་མཆོག་བཀོད་ཅིང་།
en: In the supreme state of happiness and peace free from misery,

source: །འཁོར་ལོ་མཚུངས་མེད་འཇིག་རྟེན་ཀུན་བསྐོར་ནས།
en: And after turning the unequalled wheel in all the worlds,

source: །ཕྱི་ནས་ཉོན་མོངས་རྡུལ་མེད་མྱ་ངན་འདས།
en: He will purify the afflictions and pass into nirvāṇa.

source: །སུ་ཞིག་དགའ་མགུ་སེམས་ཀྱི་གོས་ཀྱིས་ནི། །བཅོམ་ལྡན་མཆོད་རྟེན་རྣམས་ལ་མཆོད་བྱས་པ།
en: “Whoever worships the stūpas of the blessed ones By offering fabrics with a joyful mind

source: །དེ་ནི་གོས་མཛེས་བྱེ་བ་སྟོང་རྣམས་དང་། །ཁྲག་ཁྲིག་བརྒྱ་བགྲངས་མཐའ་ཡས་རྟག་ཏུ་རྙེད།
en: Will always receive countless billions and Trillions of beautiful fabrics.

source: །བཅོམ་ལྡན་མཆོད་རྟེན་གོས་ཀྱིས་དཀྲིས་བྱས་ན།
en: “Whoever drapes the stūpa of a blessed one with fabric

source: །དེ་ནི་བཙས་མ་ཐག་ཏུ་གོས་མཆོག་འཐོབ།
en: Will, as soon as he is born, receive the best fabrics,

source: །ལྷ་ཡི་ཁྱད་འཕགས་དར་གོས་རབ་བཟང་རྙེད།
en: The most excellent and extraordinary divine silks and fabrics,

source: །བཙས་མ་ཐག་ཏུ་དེ་ལུས་ཤིན་ཏུ་བདེ།
en: And from birth will have a healthy body.

source: །གང་ཞིག་གོས་ཀྱིས་བཅོམ་ལྡན་མཆོད་རྟེན་དང་། །འདྲེན་པ་མཚུངས་མེད་རྣམས་ལ་མཆོད་བྱེད་པ།
en: “Whoever offers fabric to the stūpas of the blessed ones— The unequalled leaders—

source: །དེ་འདིར་མཚུངས་པ་མེད་པའི་ལུས་ཐོབ་སྟེ།
en: Will, in this life, obtain an unequalled body

source: །སུམ་ཅུ་རྩ་གཉིས་མཚན་གྱི་མེ་ཏོག་རྒྱས།
en: Adorned with the flowers of the thirty-two marks.

source: །ལག་མཐིལ་ནས་ནི་མུ་ཏིག་ཕྲེང་མཛེས་པ།
en: Will, for countless eons, find in his hands

source: །སྣ་ཚོགས་དག་དང་སེང་གེའི་ཕྲེང་བ་དང་། །གསེར་སྐུད་རབ་མཛེས་བསྐལ་པ་མཐའ་ཡས་འབྱུང་།
en: Beautiful and variegated pearl garlands, As well as flower garlands and gorgeous golden threads.

source: །ལྷ་འམ་ཀླུ་འམ་མིའམ་ལྟོ་འཕྱེ་ཆེ། །སུ་ཡང་དེ་ལ་མ་དད་སྐྱེད་མི་བྱེད།
en: Will not be distrusted by anyone, Whether gods, nāgas, humans, or mahoragas,

source: །རྟག་ཏུ་ཚངས་པར་སྤྱོད་པ་མཆོག་འདི་སྤྱོད།
en: And he will always engage in the supreme pure conduct.

source: །སྟོང་གི་འཇིག་རྟེན་ཁམས་ཀུན་ཟིལ་གནོན་ཏེ།
en: Will outshine the entire trichiliocosm,

source: །འཛམ་ཀླུང་གསེར་གྱིས་གསེར་ནི་ཟིལ་མནན་བཞིན།
en: Just like the gold of the Jambū river outshines all other types of gold.

source: །སྐྱེ་དགུ་དོན་ནི་དཔག་ཏུ་མེད་པ་བྱེད།
en: He will benefit beings in ways that cannot be fathomed. “The splendor created by filling the entire trichiliocosm

source: །གལ་ཏེ་རིན་ཆེན་རབ་མཆོག་སྣ་བདུན་གྱིས། །སྟོང་གི་ཞིང་ཀུན་རབ་ཏུ་བཀང་བ་ཡི། །དེ་འདྲའི་དཔལ་འདི་ཟད་པར་བྱ་ནུས་ཀྱི།
en: With the seven supremely precious substances could be depleted.

source: །རྒྱལ་བའི་མཆོད་རྟེན་གོས་གཅིག་ཕུལ་བའི་མིན།
en: But that of offering a single piece of fabric To the stūpa of a victor could not.

source: །ནོར་བུ་རིན་ཆེན་ཟླ་བའི་འོད་རྣམས་ཀྱིས། །བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཞིང་བཀང་བ།
en: “The splendor created by filling billions and trillions of universes

source: །དེ་འདྲའི་དཔལ་འདི་ཟད་པར་བྱ་ནུས་ཀྱི།
en: With precious jewels that resemble moonlight could be depleted.

source: །འཇིག་རྟེན་སངས་རྒྱས་འགྱུར་ཞེས་མོས་བསྐྱེད་དེ། །བཅོམ་ལྡན་མཆོད་རྟེན་བ་དན་ཕུལ་བྱས་ན།
en: While aspiring to become a buddha in the world,

source: །དེ་ནི་སྐྱེ་བོ་མང་པོའི་མཆོད་འོས་འགྱུར།
en: Will be worthy of the worship of many beings,

source: །བྱང་ཆུབ་མཆོག་སྤྱད་དམ་པ་ཞི་བ་སྤྱོད།
en: And will engage in the supreme awakened conduct—sublime and peaceful.

source: །བཅོམ་ལྡན་མཆོད་རྟེན་བ་དན་ཕུལ་བྱས་ན།
en: “Whoever offers banners to the stūpa of a blessed one

source: །དག་ཅིང་མཆོག་གི་ལུས་ནི་འཐོབ་འགྱུར་ཏེ།
en: Will obtain a perfect and supreme body,

source: །དཔེར་ན་གསེར་ལྟར་ཤིན་ཏུ་དགར་འགྱུར་ཞིང་།
en: Which is pure like gold.

source: །ལྷ་ཡིས་བསྔགས་ལ་མཆོད་ཅིང་བླ་མར་བྱེད།
en: He will be praised, worshiped, and respected by the gods.

source: །དེ་ཡི་ལུས་ནི་གསེར་གྱི་མདོག་འདྲར་འགྱུར།
en: “His body will have a golden complexion.

source: །རས་ཀྱི་གོས་དང་ལ་བ་བཟང་རབ་དང་། །དུ་གུ་ལ་དང་ཀ་ཤི་ཀ་རྣམས་དང་། །ཤིན་ཏུ་མཛེས་པའི་གོས་ཀྱང་རྙེད་པར་འགྱུར།
en: He will obtain the finest cotton fabrics and cloaks, Dukūla garments, silken clothing, And exquisite fabrics. “In the world, he will always be born

source: །འཛམ་བུའི་གླིང་ན་རིགས་མཆོག་དམ་པ་གང་།
en: Into the best, most eminent families

source: །ཕྱུག་ཅིང་ཆེ་ཉིད་བདག་དབང་ནོར་མང་བ། །དེ་དག་ཏུ་ནི་རྟག་ཏུ་དེ་སྐྱེ་སྟེ།
en: As a rich, great, and affluent lord.

source: །དམན་ཞིང་མཆོག་ཏུ་དབུལ་བ་རྣམ་པར་སྤངས།
en: He will abandon birth in inferior or destitute families.

source: །དེ་ལ་སེམས་ཅན་སུ་ཡང་ཕྲག་དོག་མེད།
en: “No sentient being will be jealous

source: །སེམས་ཅན་གནོད་པར་སེམས་པ་གཞར་མི་འབྱུང་།
en: Or give rise to malice toward him.

source: །གཞན་གྱི་སྡིག་པའི་ལས་ལ་དེ་སྨོད་དེ།
en: Condemning the evil actions of others,

source: །རྟག་ཏུ་བག་ཡོད་ཚུལ་ཁྲིམས་རྣམ་དག་འགྱུར།
en: He will always be conscientious and perfectly disciplined.

source: །འཛིན་པ་མེད་ཅིང་སེར་སྣ་མེད་པར་འོང་།
en: “He will be devoid of grasping and stinginess.

source: །གཏོང་བ་རབ་བཏང་མྱ་ངན་མེད་པ་འཐོབ།
en: Practicing generosity, he will gain freedom from misery,

source: །དེ་ནི་སྲོག་ཕྱིར་གཞན་ལ་སྦྱིན་མི་བྱེད།
en: But he will not give to others merely to save his own life.

source: །ཕོངས་པ་མེད་བྱེད་རྟག་ཏུ་བག་ཡོད་འགྱུར།
en: Free from poverty, he will always be conscientious.

source: །སངས་རྒྱས་སྟོབས་བཅུ་དེད་དཔོན་མཐོང་ནས་ནི།
en: “Upon meeting a captain, a buddha endowed with the ten powers,

source: །དགའ་བའི་སེམས་ཀྱིས་གདུགས་དང་བ་དན་དང་། །མར་མེ་རྣམས་ཀྱིས་བཅོམ་ལྡན་འདས་ལ་མཆོད།
en: He will joyfully worship that blessed one By offering parasols, banners, and lamps.

source: །བྱང་ཆུབ་སྤྱོད་མཆོག་འདི་ནི་རྟག་པར་སྤྱོད།
en: He will always engage in the supreme awakened conduct.

source: །མི་ཡི་འཇིག་རྟེན་བླ་མར་བསྙེན་བཀུར་བྱེད།
en: “He will be respected and venerated in the human world,

source: །ལྷ་ནང་ལྷ་ཡི་དག་དང་མི་ཡི་གཙོ།
en: And will become a lord of the gods and a chief of humans,

source: །ཡིད་འོང་སྤོས་མཛེས་བལྟ་ན་སྡུག་པ་དང་། །ནོར་བུ་ཤེལ་འདྲ་སྣ་ཚོགས་ལྡན་པ་འཐོབ།
en: Pleasingly perfumed and handsome, beautiful to behold, Possessing various gems such as crystal.

source: །རི་རབ་རྩེ་མོར་ལྷ་ནང་རབ་ཏུ་གསལ།
en: “On the summit of Mount Meru, he will become resplendent among the gods,

source: །ལྷ་ཀུན་སློབ་མར་གྱུར་ནས་མངོན་དུ་འདུད།
en: Who will all become his disciples and bow down to him.

source: །ཆོས་ཀྱིས་དེ་དག་ཡིད་བདེ་སྐྱེད་པར་བྱེད།
en: He will please their minds through the Dharma,

source: །དེ་ལ་དད་མཆོག་གཞའ་གསང་འཐོབ་པར་འགྱུར།
en: And they will develop supreme and unwavering faith in him.

source: །དེ་ནས་ཤི་འཕོས་མི་ཡི་འཇིག་རྟེན་དུ།
en: “Then, after he dies, he will become an eminent king—

source: །རྒྱལ་པོ་དམ་པ་སྟོབས་ལྡན་འཁོར་ལོས་སྒྱུར།
en: A powerful universal monarch in the human world.

source: །དེ་ལ་སེམས་ཅན་སུ་ཡང་སྡིག་མི་སྐྱེད།
en: No one will commit evil deeds toward him,

source: །སྐྱེ་བོ་མང་པོ་དགའ་ཞིང་ཡིད་འོང་འགྱུར།
en: And he will please and delight many beings.

source: །རྡུལ་བསལ་སེམས་ཅན་མཆོག་ལ་རྒྱལ་མཚན་ཕུལ།
en: “Whoever offers a victory banner to a supreme, stainless being

source: །རིང་པོར་མི་ཐོགས་ནོར་མང་རྙེད་པར་འགྱུར།
en: Will, before long, become very rich.

source: །ཤེས་རབ་མཐའ་ཡས་མཛོད་ནི་མང་ལྡན་འོང་།
en: Possessing a great treasure of infinite insight,

source: །སེམས་ཆུང་མི་འགྱུར་དམན་པའི་སེམས་མི་འགྱུར།
en: He will neither be mentally weak nor adopt inferior attitudes.

source: །ལོངས་སྤྱོད་རྙེད་ནས་བགེད་ཅིང་བདག་ཀྱང་སྤྱོད།
en: “Acquiring enjoyments, he will share and enjoy them.

source: །དེ་ནི་འཇིགས་མེད་ཡིད་མི་བདེ་བ་མེད།
en: He will be fearless and free from distress.

source: །རྒྱལ་པོ་དགའ་ནས་གྲོང་དང་ཡུལ་འཁོར་བགེད།
en: As a king, he will joyfully share his possessions throughout his villages and land,

source: །གཙོ་བོ་ཁྱད་པར་འཕགས་པ་མཛོད་མང་ཞིང་།
en: “He will become a wealthy and most eminent chief,

source: །ཁྱིམ་བདག་རིན་ཆེན་སྣ་ཚོགས་ལུས་བརྒྱན་འགྱུར།
en: A householder adorned with many precious gems,

source: །རྒྱལ་པོའི་བུ་འམ་དེ་བཞིན་བློན་པོར་འོང་།
en: A prince, or a minister.

source: །རྒྱལ་པོར་གྱུར་ནས་སྟོབས་ལྡན་རྫི་བ་མེད།
en: Once he becomes a king, he will be powerful and invincible.

source: །བརྙས་པའི་རིགས་དམའ་ཐམས་ཅད་ཡོངས་སུ་སྤོང་།
en: “Abandoning birth into despicable, inferior families,

source: །ལོངས་སྤྱོད་ཁྱད་འཕགས་རིགས་མཆོག་རྙེད་ནས་ནི།
en: He will be born into the best, most eminent, and prosperous families.

source: །རྟག་ཏུ་བག་ཡོད་སེམས་ནི་ཞུམ་མི་འགྱུར།
en: He will always be conscientious and never feel disheartened.

source: །འདོད་པ་རྣམས་ནི་ངན་སྐྱུགས་ཁུང་ལྟར་སྤོང་།
en: He will abandon all desires as if they were a pit of vomit.

source: །ཁྱད་འཕགས་གཟུགས་དང་མཚན་རྣམས་རབ་ཏུ་འཐོབ།
en: “He will obtain an extraordinary appearance with the marks.

source: །ཁྱད་འཕགས་རིགས་དང་དེ་བཞིན་དབང་ཕྱུག་ཉིད།
en: Born into the most eminent families or as a powerful lord,

source: །དེ་ཡི་གཡོག་འཁོར་རྟག་ཏུ་མི་ཕྱེད་འགྱུར།
en: His servants and attendants will never part from him;

source: །སྐྱེ་བོ་མང་པོས་མདུན་དུ་བདར་བར་འོང་།
en: He will be followed by many beings.

source: །དེ་ནི་གཞན་ལ་གནོད་པའི་སེམས་མི་སྐྱེད།
en: “He will never give rise to malice toward others,

source: །སེམས་ནི་རབ་དང་རྟག་ཏུ་བག་ཡོད་ལྡན།
en: His mind will be excellent, he will always be conscientious, and

source: །དེ་ལ་མེ་དང་དུག་དང་མཚོན་མི་ཚུགས།
en: He will never be harmed by fire, poison, or weapons;

source: །སྐྱེ་བོ་ཚོགས་ཆེན་གྱིས་ནི་བལྟ་བར་འགྱུར།
en: Instead, he will be attended to by great assemblies of beings.

source: །རབ་ཏུ་དགའ་ཞིང་ཐུབ་པའི་ཆོས་ལ་སྤྱོད།
en: “He will joyfully practice the Sage’s Dharma.

source: །ཤེས་བཞིན་ལྡན་ནས་ཡིད་བདེ་སྐྱེད་པར་བྱེད།
en: Alert, he will develop happiness.

source: །འཛིན་པ་མེད་ཅིང་ཆགས་མེད་སེམས་དང་ལྡན།
en: His mind will be free from grasping and attachment,

source: །ཆགས་མེད་གྱུར་ནས་དེ་ལ་མི་འཐུན་མེད།
en: And, free from desire, he will experience no conflict.

source: །དེ་ཡི་ལུས་གཙང་ཀུན་ནས་ཉོན་མོངས་མེད།
en: “His body will be clean and devoid of defilement.

source: །རྣམ་དག་སེམས་ལྡན་དེ་ནི་བདེན་པར་སྨྲ།
en: His mind will be pure, and he will speak truthfully.

source: །འཇིགས་པས་ཉེན་པ་རྣམས་ལ་ཡིད་བདེ་སྐྱེད།
en: He will comfort those who are overwhelmed by fear,

source: །སེམས་ཅན་རྣམས་ཀྱི་སྐྱབས་དང་དཔུང་གཉེན་འགྱུར།
en: And be a refuge and a friend for sentient beings.

source: །དེ་ནི་བདག་དོན་རྒྱ་ཆེན་བྱས་ནས་སུ།
en: “Vastly accomplishing his own welfare,

source: །གཞན་ཡང་སངས་རྒྱས་ཡེ་ཤེས་རྫོགས་ལ་འགོད།
en: He will also establish others in perfect awakened wisdom.

source: །ཤིང་དབང་ཤིང་མཆོག་དམ་པའི་དྲུང་སོང་ནས།
en: In the presence of the sacred, supreme bodhi tree,

source: །མཚུངས་མེད་མཆོག་ཞི་བྱང་ཆུབ་འཚང་ཡང་རྒྱ།
en: He will awaken to the unequaled, supreme peace.

source: །སངས་རྒྱས་མཆོད་རྟེན་མར་མེ་གཅིག་ཕུལ་ན།
en: “When someone offers a single lamp to the stūpa of a buddha, The splendor created thereby cannot be depleted,

source: །འདི་ནས་བཟུང་སྟེ་སྲིད་པའི་རྩེ་མོའི་བར།
en: Since it equals filling this entire buddhafield

source: །སངས་རྒྱས་ཞིང་ནི་འཛམ་ཀླུང་གསེར་གྱིས་གང་། །དེ་འདྲའི་དཔལ་དེ་ཟད་པར་བྱ་མི་ནུས།
en: To the summit of existence with gold from the Jambū river.

source: །བཅོམ་ལྡན་མཆོད་རྟེན་མར་མེ་ཕུལ་བྱས་ན།
en: “When someone offers a lamp to the stūpa of a blessed one,

source: །དེ་ཡི་ལུས་ནི་མདོག་ངན་ཡོང་མི་འགྱུར།
en: He will never be born with an ugly appearance.

source: །གཟུགས་མཆོག་སྲ་ཞིང་ལག་པ་གཟུ་བ་འདྲ།
en: His body will be supremely strong, and his arms will be like pillars.

source: །སྣང་བ་ཐོབ་ནས་འཇིག་རྟེན་ཀུན་ཏུ་རྒྱུ།
en: Having attained illumination, he will move about in all the worlds.

source: །གལ་ཏེ་རྒྱལ་བ་དམ་པ་བྱུང་གྱུར་ན།
en: “When the sublime victorious ones have appeared,

source: །དེ་བཞིན་གཤེགས་པ་རྣམས་དང་ཉེ་བར་འགྱུར།
en: He will approach these thus-gone ones.

source: །ཉེ་དུར་འགྱུར་རམ་ཡང་ན་བུར་ཡང་འགྱུར།
en: He will become their relative or son,

source: །དེ་ནི་ཡེ་ཤེས་ཕུང་པོ་མྱུར་དུ་འཐོབ།
en: And will swiftly attain a mass of wisdom. “One may count, assess, and declare the number of mustard seeds

source: །གལ་ཏེ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་སངས་རྒྱས་ཞིང་། །ཡུངས་འབྲུ་དག་གིས་བྱུར་བུར་གང་གྱུར་པ། །བགྲང་བ་དང་ནི་གཞལ་ཞིང་བརྗོད་པར་ནུས།
en: Required to fill ten trillion buddhafields completely,

source: །བདེ་གཤེགས་མར་མེ་གཅིག་ཕུལ་དེ་ལྟ་མིན།
en: But not the merit created by offering A single butter lamp to a well-gone one.

source: །སངས་རྒྱས་དམ་པ་མཚུངས་མེད་སྦྱིན་པའི་གནས།
en: “The sublime, peerless buddha is worthy of offerings.

source: །སྤྱོད་པ་མཆོག་སྤྱད་ཁྱད་པར་བརྙེས་གྱུར་པ།
en: He is a preeminent being engaged in supreme conduct.

source: །མི་མཆོག་དེ་ལ་མཆོད་པ་འདིར་བྱས་པ།
en: One who worships that supreme man

source: །རྣམ་པར་སྨིན་པ་དམ་པ་གཞལ་ཡས་འགྱུར།
en: Will experience measureless, sublime results in return.

source: །གལ་ཏེ་མི་མཇེད་འཇིག་རྟེན་ཁམས་འདི་ཀུན།
en: “Even if this entire Sahā world

source: །ནོར་བུ་རིན་ཆེན་བཻ་དཱུརྱས་གང་བ།
en: Were filled to the brim with precious beryl gems, this merit could be depleted.

source: །ཟད་པར་བྱ་ནུས་སངས་རྒྱས་མཆོད་རྟེན་ལ།
en: But the splendor created by offering a single lamp

source: །མར་མེ་གཅིག་ཕུལ་དཔལ་དེ་ཟད་མི་འགྱུར།
en: To the stūpa of a buddha will never be depleted.

source: །ཀཱར་ཥཱ་པ་ཎས་མི་མཇེད་འཇིག་རྟེན་ཁམས།
en: “Even if this entire Sahā world were filled with coins

source: །འོག་ནས་སྲིད་པའི་རྩེ་མོའི་བར་གང་བ།
en: Up to the summit of existence, this merit could be depleted.

source: །སངས་རྒྱས་ཞིང་སྟོང་དེ་དག་ཙན་དན་གྱིས།
en: “Even if a thousand buddhafields were filled with sandalwood

source: །ཚངས་པའི་འཇིག་རྟེན་ཡོད་པའི་ལྷ་རིས་ཀྱི།
en: With divine fabric from the Brahmā world, this merit could be depleted.

source: །གོས་ཀྱིས་སངས་རྒྱས་ཞིང་སྟོང་གང་གྱུར་པ། །ཟད་པར་བྱ་ནུས་སངས་རྒྱས་མཆོད་རྟེན་ལ།
en: But the splendor created by offering a single lamp

source: །ཀླུ་དང་ལྷ་མིན་མི་དང་ལྟོ་འཕྱེ་ཆེ། །ལྷ་ཡི་ལྷ་རྫས་ནོར་བུ་རིན་ཆེན་མང་།
en: Of nāgas, asuras, humans, mahoragas, and gods may be depleted.

source: །ལྷ་ཡི་འཇིག་རྟེན་ཡོད་པའི་ལྷ་ཡི་སྤོས། །དེ་དག་མི་མཇེད་འདི་ཀུན་གང་གྱུར་པ།
en: Present in the worlds of the gods, this merit could be depleted.

source: །ཕྱོགས་དང་ཕྱོགས་མཚམས་ཚད་ནི་ཤེས་པར་ནུས།
en: “One could know the extent of all the directions,

source: །ནམ་མཁའི་ཁམས་འདིའི་ཚད་ཀྱང་ཤེས་པར་ནུས།
en: And one could even know the extent of space itself.

source: །སངས་རྒྱས་མཆོད་རྟེན་མར་མེ་གཅིག་ཕུལ་བའི།
en: But the splendor created by offering a single lamp

source: །དེ་འདྲའི་དཔལ་དེ་ཟད་པར་བྱ་མི་ནུས།
en: To the stūpa of a buddha can never be depleted.

source: །སངས་རྒྱས་དམ་པ་མི་མཆོག་བཞུད་པའི་ཚེ།
en: “When the sublime buddhas, the supreme human beings, appeared,

source: །འདྲེན་པ་མཚུངས་པ་མེད་ལ་དད་བྱས་ཏེ། །སྟོན་པའི་སྐུ་ལ་ཉི་ཟེར་མི་འབབ་པར།
en: I was devoted to those peerless leaders

source: །མེ་ཏོག་མ་ལི་ཀ་གདུགས་བཅོམ་ལྡན་ཕུལ།
en: And offered parasols made of malikā flowers to the blessed ones, To protect these teachers’ bodies from sunrays.

source: །དེ་ནི་ལས་མཛེས་དམ་པ་གུས་བྱས་པས།
en: “By serving the sublime beings with such beautiful acts,

source: །ལྷ་དབང་བརྒྱ་བྱིན་དུ་ནི་ལན་འབུམ་གྱུར།
en: I was reborn a hundred thousand times as Śakra, lord of the gods,

source: །འཇིག་རྟེན་ཀུན་ཏུ་ཚངས་པའི་བདག་པོར་གྱུར།
en: And as Lord Brahmā, ruling over all the worlds.
